Repository: ashessin/TouchpadIndicator
Catalog: locale/*/LC_MESSAGES/*.po
Languages: it

source: About
it: Info

source: View debug information.
it: Visualizza le informazioni di debug.

source: Set switching method and indicator icon preferences.
it: Imposta il metodo di spegnimento/accensione e le preferenze per le icone.

source: Touchpad Indicator
it: Indicatore Touchpad

source: Confirm Dialog
it: Dialogo di conferma

source: Would you really disable this device? There seems to be no other mouse device enabled!
it: Vuoi davvero disabilitare questo dispositivo? Sembra che non ci sia nessun altro dispositivo di puntamento attivo!

source: Cancel
it: Annulla

source: Pen
it: Penna

source: Touchpad Preferences
it: Preferenze Touchpad

source: Indicator Preferences
it: Preferenze Indicatore

source: Mouse plugged in -
it: Mouse collegato -

source: Mouse unplugged -
it: Mouse scollegato -

source: touchpad and trackpoint enabled
it: touchpad e trackpoint attivati

source: touchpad and trackpoint disabled
it: touchpad e trackpoint disattivati

source: touchpad enabled
it: touchpad attivato

source: touchpad disabled
it: touchpad disattivato

source: trackpoint enabled
it: trackpoint attivato

source: trackpoint disabled
it: trackpoint disattivato

source: First time startup
it: Mostra la schermata di benvenuto ad ogni avvio

source: Automatically switch Touchpad On/Off
it: On/off automatico del touchpad

source: Turns touchpad automatically on or off if a mouse is (un)plugged.
it: Accende/spegne il touchpad se un mouse è (s)collegato.

source: Automatically switch Trackpoint On/Off
it: On/off automatico del trackpoint

source: Turns trackpoint automatically on or off if a mouse is (un)plugged.
it: Accende/spegne il trackpoint se un mouse è (s)collegato.

source: Show notification
it: Mostra notifiche

source: Show notifications if the touchpad or the trackpoint is automatically switched on or off.
it: Notifica se il touchpad o il trackpoint vengono automaticamente accesi o spenti.

source: Debug log
it: Log del debug

source: Turns the debug log on or off.
it: (Dis)attiva il log del debug.

source: Write debug information to file.
it: Scrive le informazione di debug in un file.

source: All debug logs are additionally written to the file 'touchpad-indicator.log' in the extension directory. Attention! This feature will slow down the startup of gnome-shell and the usage of the extension.
it: Tutti i log di debug sono automaticamente scritti all'interno del file 'touchpad-indicator.log' posto nella directory dell'estensione. Attenzione! Questa caratteristica rallenterà l'avvio di gnome-shell e l'utilizzo dell'estensione.

source: Switch Method
it: Metodi di on/off automatico

source: Method by which to switch the touchpad.
it: Modalità attraverso la quale avviene l'accensione/spegnimento automatica del touchpad.

source: Choose possible touchpad
it: Selezionare un possibile touchpad

source: You can choose the mouse entry which could be the touchpad.
it: È possibile selezionare la voce il quale dovrebbe essere il touchpad.

source: Exclude mouse device from autodetection
it: Escludi periferiche di puntamento dall'autorilevamento

source: Here you can choose some mouse devices to be excluded from autodetection, like your IR Remote Control or something similar. All chosen devices are ignored.
it: Qui è possibile selezione alcune periferiche di puntamento da escludere, dall'autorilevamento (ad esempio un gestore di presentazioni). Tutte le periferiche selezionate sono ignorate.

source: Show Icon in Main Panel
it: Mostra icona nel pannello principale

source: Show or hide the icon in the panel
it: Mostra o nasconde l'icona sul pannello

source: Welcome
it: Benvenuto

source: Attention - No Touchpad Detected
it: Attenzione - Nessun touchpad rilevato

source: The extension could not detect a touchpad at the moment. You'll find further information in the Debug section.
it: Questa estensione non può rilevare alcun touchpad al momento. Ulteriori informazioni sono rintracciabili nella sezione 'Debug'.

source: These settings allow you to customize this extension to your needs. You can open this dialog again by clicking on the extension's icon and selecting Indicator Preferences. Please feel free to contact me if you find bugs or have suggestions, criticisms, or feedback. I am always happy to receive feedback - whatever kind. :-) Contact me on github (https://github.com/orangeshirt/gnome-shell-extension-touchpad-indicator) or on my bug tracker (https://extensions.gnome.org/extension/131/touchpad-indicator/).
it: Queste impostazioni consentono di personalizzare questa estensione secondo i propri bisogni. È possibile accedere nuovamente a questa finestra cliccando sull'icona dell'estensione e selezionando 'Impostazioni indicatore'.\n \n Ritieniti libero di contattarmi se trovi un bug o hai suggerimenti, critiche o feedback. Sono sempre felice di ricevere feedback - di qualunque tipo. :-) \n \n Contattami su github (https://github.com/orangeshirt/gnome-shell-extension- touchpad-indicator) o sul mio bug tracker (https://extensions.gnome.org/ extension/131/touchpad-indicator/).

source: General
it: Generale

source: Gconf Settings
it: Impostazioni Gconf

source: Auto Switch
it: On/off automatico

source: Define the behaviour if a mouse is (un)plugged.
it: Specifica cosa avviene se una periferica di puntamento è (s)collegata.

source: Settings for debugging the extension.
it: Impostazioni per il debug dell'estensione.

source: Warning - No Touchpad Detected
it: Attenzione - Nessun touchpad rilevato

source: The extension could not detect a touchpad at the moment. Perhaps your touchpad is not detected correctly by the kernel. The following devices are detected as mice:
it: Questa estensione potrebbe non rilevare un touchpad al momento. Forse il touchpad non è rilevato correttamente dal kernel. Le seguenti periferiche sono rilevate come mouse:

source: Try to find the touchpad
it: Prova a trovare un touchpad

source: You could try to find a possible touchpad. Below you could choose the possible touchpad from the list of the detected mice. In most cases you should choose the entry 'PS/2 Generic Mouse' if available. The switch method will be automatically switched to Xinput, because only with Xinput it is possible to switch an undetected touchpad.
it: È possibile provare a trovare un touchpad. Di seguito è potrebbe essere scelto un possibile touchpad dalla lista dei mouse rilevati. Nella maggior parte dei casi si dovrebbe scegliere la voce 'PS/2 Generic Mouse' se disponibile. Il metodo di on/off automatico sarà automaticamente impostato su Xinput, perchè solo con Xinput è possibile accendere/spegnere un touchpad non rilevato.

source: No Xinput installed
it: XInput non installato

source: If you install 'xinput' on your pc, the extension could try to switch an undetected touchpad. Please install 'xinput' and reload gnome-shell to enable this feature.
it: Con l'installazione di 'xinput', l'estensione potrebbe provare a pilotare automaticamente un touchpad non rilevato. Per favore installare 'xinput' e riavviare GNOME shell per abilitare questa caratteristica.

source: Gnome Shell Version:
it: Versione Gnome Shell:

source: Touchpad Indicator Version:
it: Versione di Touchpad Indicator:

source: Touchpad(s):
it: Touchpad:

source: Is installed.
it: È installato.

source: Not found on your system.
it: Non trovato nel sistema.

source: Is installed and in use.
it: Installato e in uso.\n

source: Not found or used on your system.
it: Non trovato o utilizzato nel sistema.\n

source: Switch Method:
it: Metodi di on/off automatico:

source: Debug Informations
it: Informazioni di Debug

source: Here you find some information about your system which might be helpful in debugging.
it: Qui è possibile trovare informazioni riguardo il sistema che potrebbero essere utili nel debug.

source: Debug Log
it: Log del Debug

source: The debug log since last restart, if debugging to file was enabled.
it: Se il debug è stato attivato qui sotto ne è riportato il log a partire dall'ultimo riavvio.

source: Sorry could not read logfile!
it: Mi spiace, non riesco a leggere il file di log!

source: - No mouse device detected.
it: - Nessun dispositivo di puntamento rilevato..

source: No Touchpad detected.
it: Nessun Touchpad rilevato.
